{
  "title": "Logica simulator",
  "debug": "offsets: {{ canvas.xOffset }}, {{ canvas.yOffset }} interval:{{ canvas.gridInterval }}, schaal: {{ zoom.scaleFactor }}",
  "state": "staat: {{ getCurrentComponent }}",
  "dragging state": "aan het slepen @{{ currentDragging }}",
  "fileDropdown": "Bestand",
  "extrasDropdown": "Extras",
  "new": "Nieuw...",
  "save": "Opslaan",
  "load": "Inladen",
  "file": "Bestand",
  "logicanalyzer": "Logica analyzer",
  "run-text": "SIMULEER",
  "edit-text": "BEWERK",
  "stepper-text": "STEPPER",
  "next-text": "VOLGENDE",
  "undo-text": "UNDO",
  "redo-text": "REDO",
  "ToolbarExplanation": "Toolbar, hier kan je componenten selecteren om aan het werkvlak toe te voegen. Klik op de rechtermuisknop om meer te weten te komen over een component.",
  "ToolbarExplanation2": "Ook zijn er enkele tools beschikbaar om draden te tekenen alsook om een component te verwijderen.",
  "MaincanvasExplanation": "Werkvlak, hier zal je het circuit tekenen. Door de pijltjestoetsen te gebruiken kan je het canvas verschuiven. Zoomen kan met het muiswiel.",
  "NavbarExplanation": "Navigatiebalk, het circuit opslaan of een vorig circuit laden doe je hier. Onder extras kan je ook zaken vinden zoals het bekijken van de output van een logic analyzer.",
  "RunEditButtonsExplanation": "Simuleer en bewerk knoppen, via deze knoppen kan je wisselen tussen de 2 modi. De simuleer knop simuleert het circuit, de bewerk knop laat je het circuit bewerken.",
  "StepperExplanation": "Stepper, de stepper modus laat het circuit simuleren gelijkaardig aan de simuleer modus maar dan stap per stap. Deze modus is handig voor het debuggen.",
  "UndoRedoExplanation": "Undo and redo buttons, als je iets hebt toegevoegd, aangepast of verwijderd kan je deze bewerking terugdraaien.",
  "ShortCutExplanation": "Om makkelijker te werken zijn volgende shortcuts beschikbaar: Undo (Ctrl + Z), Redo (Ctrl + Y), Opslaan (Ctrl + S), Verwijderen (R), Draad tekenen (F). Om te stoppen met het tekenen van een manuele lijn of het verplaatsen van een component kan je op Escape duwen.",
  "RightClickExplanation": "Klik met de rechtermuisknop op een geplaatste component om de delay of andere instellingen aan te passen, afhankelijk van het type van component.",
  "welcome": "Welkom bij Logica Simulator",
  "goodluck": "Veel plezier!",
  "guidedTour": "Rondleiding",
  "componentInfo": "Info over component",
  "or-gateDesc": "Deze gate is een OR gate. Deze zal de waarde 1 geven als minstens 1 van de ingangen waarde 1 heeft.",
  "or-gateTitle": "OR gate",
  "and-gateDesc": "Deze gate is een AND gate. Deze zal de waarde 1 geven als alle ingangen waarde 1 hebben.",
  "and-gateTitle": "AND gate",
  "not-gateDesc": "Deze gate is een NOT gate. Deze zal de waarde van de ingang negatief geven. (1 -> 0, 0 -> 1)",
  "not-gateTitle": "NOT gate",
  "nand-gateDesc": "Deze gate is een NAND gate. Deze zal de waarde 0 geven als alle ingangen waarde 1 hebben.",
  "nand-gateTitle": "NAND gate",
  "nor-gateDesc": "Deze gate is een NOR gate. Deze zal de waarde 0 geven als minstens 1 van de ingangen waarde 1 heeft.",
  "nor-gateTitle": "NOR gate",
  "xor-gateDesc": "Deze gate is een XOR gate. Deze zal de waarde 1 geven als enkel 1 van de ingangen waarde 1 heeft.",
  "xor-gateTitle": "XOR gate",
  "xnor-gateDesc": "Deze gate is een XNOR gate. Deze zal de waarde 0 geven als enkel 1 van de ingangen waarde 1 heeft.",
  "xnor-gateTitle": "XNOR gate",
  "d-flipflopDesc": "Dit is een D Flip Flop. Wanneer de clock naar hoog stijgt, zal deze de waarde van D propagaren naar Q.",
  "d-flipflopTitle": "D Flip Flop",
  "sr-latchDesc": "Dit is een SR Latch. Wanneer de S gezet wordt, zal Q hoog geven, en wanneer de R gezet wordt, zal Q laag geven.",
  "sr-latchTitle": "SR Latch",
  "pinDesc": "Deze knop zal een gekozen waarde behouden, klik op de knop om deze waarde te veranderen.",
  "pinTitle": "Pin",
  "clockDesc": "De klok zal na ieder gekozen interval wisselen van waarde 0 naar 1 en andersom.",
  "clockTitle": "Klok",
  "logic-analyserDesc": "Deze logica analyzer zal de waarde op de plek waar je deze plaatst laten zien. De grafiek kan je vinden onder extras in de navigatiebalk.",
  "logic-analyserTitle": "Logica analyzer",
  "input-sequencerDesc": "Deze zal een opeenvolging van waardes genereren in intervals die je vooraf instelt.",
  "input-sequencerTitle": "Input sequencer",
  "LEDDesc": "De LED zal aangaan als de input waarde 1 is.",
  "LEDTitle": "LED",
  "deletingDesc": "Hiermee kan je componenten verwijderen door op een component te klikken (indien het vuilbakje open is)",
  "deletingTitle": "Verwijderen",
  "wiringDesc": "Met deze tool kan je componenten met elkaar verbinden, start bij de output en ga naar de input.",
  "wiringTitle": "Verbinden",
  "emptyDesc": "Als je een component selecteert zal er hier meer info over verschijnen.",
  "emptyTitle": "",
  "noscript": "Je browser ondersteunt geen JavaScript, of JavaScript is uitgeschakeld. Helaas werkt deze applicatie niet zonder JavaScript, robeer dit aan te zetten of gebruik een andere browser.",
  "timemilli": "Tijd (ms)",
  "save-btn": "Opslaan",
  "clock-interval": "Klok interval",
  "loading-txt": "Laden...",
  "loading-error-txt": "Het lijkt erop dat er iets is misgegaan bij het inladen, probeer uw cookies en site data te verwijderen of een andere browser te gebruiken.",
  "component-delay": "Delay van component",
  "next-btn": "Volgende",
  "prev-btn": "Vorige",
  "skip-btn": "Overslaan",
  "nameforfile": "Naam voor het bestand",
  "screenshot": "Screenshot van het circuit",
  "screenshotname": "logica-simulator-screenshot",
  "close-btn": "Sluiten",
  "lsmfile": "Selecteer een bestand met .lsm extensie dat compatibel is met deze applicatie.",
  "incompatiblefile": "Error: het opgegeven bestand is incompatibel met deze applicatie.",
  "loadcircuit": "Laad een circuit in van een bestand",
  "load-btn": "Laden",
  "clear-btn": "Circuit wissen",
  "startnew": "Nieuw circuit maken",
  "confirmnew": "Ben je zeker dat je het huidige circuit wilt wissen?",
  "savetitle": "Huidig circuit opslaan",
  "asksave": "Wil je het huidige circuit opslaan als .lsm bestand?",
  "filenamelabel": "Kies een naam voor het bestand: ",
  "error-detected": "Error gedetecteerd",
  "error_failopenfile": "Mislukt om het bestand te openen, probeer een ander bestand.",
  "error_oscillation": "Oscillatie gedetecteerd!",
  "error_nooutputs": "Dit component heeft geen outputs!",
  "error_noinputs": "Dit component heeft geen inputs!",
  "error_noinputsleft": "Geen inputs meer vrij voor dit component!",
  "error_emptyinput": "1 of meerdere input velden zijn leeg!",
  "error_deletelastinput": "De input sequencer heeft minstens 1 waarde nodig!",
  "setisvalues": "Stel waardes van input sequencer in",
  "add-btn": "Waarde toevoegen",
  "valueInput": "Waarde",
  "clear-graph-btn": "Grafiek wissen",
  "latitle": "Logica analyzer",
  "y-axis": "(0=LAAG, 1=HOOG, 0.5=FLOATING)",
  "imageModal": "Afbeelding maken",
  "multiple-save-btn":"Sla op als meerdere afbeeldingen"
}
