{
  "title": "Logic Simulator",
  "debug": "offsets: {{ canvas.xOffset }}, {{ canvas.yOffset }} interval:{{ canvas.gridInterval }}, scale: {{ zoom.scaleFactor }}",
  "state": "state: {{ getCurrentComponent }}",
  "dragging state": "dragging state {{ currentDragging }}",
  "fileDropdown": "File",
  "extrasDropdown": "Extras",
  "new": "New...",
  "save": "Save",
  "load": "Load",
  "file": "File",
  "logicanalyzer": "Logic analyzer",
  "run-text": "RUN",
  "edit-text": "EDIT",
  "stepper-text": "STEPPER",
  "next-text": "NEXT",
  "undo-text": "UNDO",
  "redo-text": "REDO",
  "ToolbarExplanation": "Toolbar, here you can select components to add to the workspace. More info will be displayed in the info-box when you select a component.",
  "ToolbarExplanation2": "Here are also some tools to edit circuits like deleting and drawing wires.",
  "MaincanvasExplanation": "Workspace, here the circuit is drawn. You can move the canvas with arrow keys on your keyboard. Zooming is possible with the scrollwheel",
  "NavbarExplanation": "Navigation bar, under file you can save (image or json) and load circuits and also start a new circuit. Under extras you can find the output of the logic analyzer.",
  "RunEditButtonsExplanation": "Run and edit buttons, use these buttons to switch between run and edit mode. In run mode you can see the simulation of the circuit in function of time, in edit mode you can add components and draw wires.",
  "StepperExplanation": "Stepper, here you can see the simulation step by step.",
  "UndoRedoExplanation": "Undo and redo buttons, if you made a mistake or want to go back and forth in edit mode you can use these buttons.",
  "ShortCutExplanation": "To make things easier you can use following shortcuts: Undo(Ctrl + Z), Redo(Ctrl + Y), Save(Ctrl + S), Deleting(R), Wiring(F). To quit drawing a line or moving a component you can use Esc.",
  "RightClickExplanation": "Right click on a placed component to edit their delay or different settings depending on the type of component.",
  "welcome": "Welcome to Logic Simulator",
  "goodluck": "Good luck!",
  "guidedTour": "Guided tour",
  "componentInfo": "Component info",
  "or-gateDesc": "This is an OR gate. It has two inputs and one output. When one of the inputs is high, the output is high.",
  "or-gateTitle": "OR gate",
  "and-gateDesc": "This is an AND gate. It has two inputs and one output. When both inputs are high, the output is high.",
  "and-gateTitle": "AND gate",
  "not-gateDesc": "This is a NOT gate. It has one input and one output. When the input is high, the output is low. When the input is low, the output is high.",
  "not-gateTitle": "NOT gate",
  "nand-gateDesc": "This is a NAND gate. It has two inputs and one output. When both inputs are high, the output is low. When one of the inputs is low, the output is high.",
  "nand-gateTitle": "NAND gate",
  "nor-gateDesc": "This is a NOR gate. It has two inputs and one output. When both inputs are low, the output is high. When one of the inputs is high, the output is low.",
  "nor-gateTitle": "NOR gate",
  "xor-gateDesc": "This is a XOR gate. It has two inputs and one output. This will only give a high output when one of the inputs is high and the other is low.",
  "xor-gateTitle": "XOR gate",
  "xnor-gateDesc": "This is a XNOR gate. It has two inputs and one output. This will only give a high output when both inputs are the same.",
  "xnor-gateTitle": "XNOR gate",
  "d-flipflopDesc": "This is a D Flip Flop. It has two inputs and two outputs. When the clock rises to high, it propagates the value of D to Q.",
  "d-flipflopTitle": "D Flip Flop",
  "sr-latchDesc": "This is a SR Latch. It has two inputs and two outputs. When S is set, Q becomes true, when R is set, Q becomes false.",
  "sr-latchTitle": "SR Latch",
  "pinDesc": "The button will have a static value, to change it you have to press it in run mode.",
  "pinTitle": "Pin",
  "clockDesc": "The clock will swap values every interval. You can set this interval when you place it or when right clicking on it.",
  "clockTitle": "Clock",
  "logic-analyserDesc": "The logic analyzer visualizes the value at a specific place in the circuit in function of time.",
  "logic-analyserTitle": "Logic analyzer",
  "input-sequencerDesc": "The input sequencer generates a sequence of values that have been set when you place it or right click on it.",
  "input-sequencerTitle": "Input sequencer",
  "LEDDesc": "De LED will turn on when the input is high.",
  "LEDTitle": "LED",
  "deletingDesc": "With this you can delete a component or wire. (if trash can is open)",
  "deletingTitle": "Delete tool",
  "wiringDesc": "With this tool you can connect components together.",
  "wiringTitle": "Wire tool",
  "emptyDesc": "If you select a component, you can see its description here.",
  "emptyTitle": "",
  "noscript": "We're sorry but this website requires JavaScript to be enabled in your browser. Please enable it or use a different browser to continue.",
  "timemilli": "Time (ms)",
  "save-btn": "Save",
  "clock-interval": "Clock interval",
  "loading-txt": "Loading...",
  "loading-error-txt": "Seems like something has gone wrong, try clearing your cookies and site data or use a different browser.",
  "component-delay": "Delay of component",
  "next-btn": "Next",
  "prev-btn": "Previous",
  "skip-btn": "Skip",
  "nameforfile": "Name for file",
  "screenshot": "Screenshot of the circuit",
  "screenshotname": "logic-simulator-screenshot",
  "close-btn": "Close",
  "lsmfile": "Please select a compatible file with the .lsm extension.",
  "incompatiblefile": "Error: the file is incompatible with this simulator.",
  "loadcircuit": "Load circuit from file",
  "load-btn": "Load",
  "clear-btn": "Clear circuit",
  "startnew": "Start new circuit",
  "confirmnew": "Are you sure you want to delete the current circuit?",
  "savetitle": "Save current circuit",
  "asksave": "Do you want to save the current circuit as .lsm file?",
  "filenamelabel": "Choose a name for the file: ",
  "error-detected": "Error detected!",
  "error_failopenfile": "Failed to load that file, please try a different file.",
  "error_oscillation": "Oscillation detected!",
  "error_nooutputs": "That component has no outputs!",
  "error_noinputs": "This components has no inputs!",
  "error_noinputsleft": "No inputs left for that component!",
  "error_emptyinput": "One or more input fields were left empty!",
  "error_deletelastinput": "The input sequencer needs at least one input!",
  "setisvalues": "Set the input sequencer values",
  "add-btn": "Add value",
  "valueInput": "Value",
  "clear-graph-btn": "Clear graph",
  "latitle": "Logic analyzer",
  "y-axis": "(0=LOW, 1=HIGH, 0.5=FLOATING)",
  "imageModal": "Image maker",
  "multiple-save-btn": "Save as multiple images"
}
